Repository: yamato/perl6doc-jp
Catalog: tm/auto/S02-bits-20140914.tmx
Source language: en_us
Languages: ja

source: (If the last is used as a subscript, the subscripter notices there are two arguments and passes that dimension's size twice.)
ja: （最後が添え字として使われるならば、subscripterは2つの引数があると気がついて、二回その次元のサイズを超える。）

source: Non-closure-returning Operators with *
ja: *をもつ非クロージャ返っている演算子

source: Operators that are known to return non-closure values with * include:
ja: *で非クロージャ値を返るために有名である演算子は、以下を含む：

source: Note that the last two also do not autoprime WhateverCode, because assignment and smartmatching are not really normal binary operators, but syntactic sugar for underlying primitives.
ja: 割当てとsmartmatchingすることが本当に通常の2項演算子でなく、根底にあるプリミティブのための構文法のシュガーであるので、最後の2つもautoprime WhateverCodeをしない点に注意しなさい。

source: (Such pseudo operators may also place restrictions on which meta-operators work on them.)
ja: （そのような疑似演算子はメタ演算子がそれらの上で動く規制も置くかもしれない。）

source: Neither do the sequence operators &amp;infix:&lt;...&gt; and &amp;infix:&lt;...^&gt; autoprime WhateverCode, because we want to allow WhateverCode closures as the stopper:
ja: 我々がストッパーとしてWhateverCodeクロージャを許したいので、そして、シーケンス演算子&amp;infix:&lt;...&gt;と&amp;infix:&lt;...^&gt; autoprime WhateverCodeはそうしない：

source: [Conjecture: it is possible that, for most of the above operators that take * to mean Inf, we could still actually return a closure that defaults that particular argument to Inf.
ja: ［推測しなさい：平均Infに*をする大部分の上記の演算子にとって、我々がInfに対するその特定の引数を怠るクロージャを実はまだ返ることができたことは、あり得る。

source: However, this would work only if we provide a &quot;value list context&quot; that forbids closures, in the sense that it always calls any closure it finds in its list and replaces the closure in the list with its return value or values, and then rescans from that point (kinda like a text macro does), in case the closure returned a list containing a closure.
ja: しかし、それが常にリストで発見する何かクロージャを呼んで、戻り値または値でリストでクロージャに代わるという点で、我々がクロージャを禁ずる「値リストコンテキスト」を提供する場合だけ、これは働く、そして、クロージャがクロージャを含んでいるリストを返る場合に備えて、それからの再走査はポイントする（いくらかマクロがするテキストのような）。

source: So for example, the closure returned by 0..* would interpolate a Range object into the list when called.
ja: とてもたとえば、呼ばれるとき、0..*によって返納印クロージャはリストにRangeオブジェクトを差し込む。

source: Alternately, it could return the 0, followed by another closure that does 1..*.
ja: あるいは、それは0を返ることができた。そして、1..*をするもう一つのクロージャが続いた。

source: Even the ... operator could likely be redefined in terms of a closure that regenerates itself, as long as we figure out some way of remembering the last N values each time.]
ja: 我々が各時最後のN値を覚えていることの若干の方法を見つけ出す限り、...演算子さえ再生するクロージャに関してたぶん再定義されることができた。］

source: In any case, array indexes must behave as such a 'value list context', since you can't directly index an array with anything other than a number.
ja: いずれにせよ、あなたが数以外の何でも配列に直接索引付けすることができない時から、配列の添字はそのような『値リストコンテキスト』としてふるまわなければならない。

source: The final element of an array is subscripted as @a[*-1], which means that when the subscripting operation discovers a Code:($) object for a subscript, it calls it and supplies an argument indicating the number of elements in (that dimension of) the array.
ja: 最終的な配列の要素は@a[*-1]（添え字付け演算が添え字のためにCode:($)オブジェクトを発見するとき、それはそれを意味する）としてsubscriptedされる。そして、それはそれを呼んで、要素数を中で示している引数を供給する（その次元）配列。

source: See S09.
ja: S09を見なさい。

source: The HyperWhatever Type
ja: HyperWhatever型

source: A variant of * is the ** term, which is of type HyperWhatever.
ja: *の変形は**項である。そして、それは型HyperWhateverである。

source: It is generally understood to be a multidimension form of * when that makes sense.
ja: それが意味をなす*の多重次元の形であることは、通常、理解される。

source: When modified by an operator that would turn * into a function of one argument, WhateverCode:($), ** instead turns into a function with one slurpy argument, Code(*@), such that multiple arguments are distributed to some number of internal whatevers.
ja: 演算子によって修正されるとき、それが1つの引数（WhateverCode:($)）の関数への*に変わって、複数の引数が若干の数の内部のwhateversに割り当てられるように、**は1つのslurpy引数（Code(*@)）で関数にその代わりに変わる。

source: That is:
ja: すなわち：

source: Therefore @array[^**] represents @array[ map ^* , @_ ], that is to say, every element of the array, no matter how many dimensions.
ja: したがって、@array[^**]は@array[ map ^* , @_ ]を表現する ― それが言うことになっている ― 配列のすべての要素、気にするな、どれくらいの次元。

source: (However, @array[**] means the same thing because (as with ... above), the subscript operator will interpret bare ** as meaning all the subscripts, not the list of dimension sizes.
ja: （しかし、@array[**]は同じものを意味する、すべての添え字（次元サイズのリストでない）を意味するように、添字演算子は裸の**を解釈する（上の...と同様に）。

source: The meaning of Whatever is always controlled by the first context it is bound into.)
ja: Whateverの意味は、それが結びつけられる最初の前後関係によって、常にコントロールされる。）

source: Other uses for * and ** will doubtless suggest themselves over time.
ja: *と**の他の用途は、おそらく時間とともに自分自身を暗示する。

source: These can be given meaning via the MMD system, if not the compiler.
ja: コンパイラとまではいかないが、これらはMMDシステムによって意味を与えられることができる。

source: In general a Whatever should be interpreted as maximizing the degrees of freedom in a dwimmy way, not as a nihilistic &quot;don't care anymore--just shoot me&quot;.
ja: Whateverがdwimmy方法で自由度を最大にして解釈されなければならない一般に、ではなく虚無主義的な、もう気にかけてはいけない－ちょうど私を撃ちなさい。

source: Native types
ja: ネイティブ型

source: Values with these types autobox to their uppercase counterparts when you treat them as objects:
ja: これらの型autoboxがあなたがそれらをオブジェクトとみなす彼らの大文字の対応する物へにある値：

source: Since native types cannot represent Perl's concept of undefined values, in the absence of explicit initialization, native floating-point types default to NaN, while integer types (including bit) default to 0.
ja: ネイティブ型が未定義値のPerlの概念を表現することができないので、明示的初期化がない場合、整数型（bitを含む）が0にデフォルトでなる間、ネイティブ浮動小数点型はNaNにデフォルトでなる。

source: The complex type defaults to NaN + NaN\i.
ja: 複素数型は、NaN + NaN\iにデフォルトでなる。

source: A buf type of known size defaults to a sequence of 0 values.
ja: 既知のサイズのbuf型は、一連の0の値にデフォルトでなる。

source: You can set a different default on any container type by use of a trait such as is default(42).
ja: あなたは、is default(42)のようなトレイトの使用によって、異なるデフォルトを何かコンテナ型の上に置くことができる。

source: Deleting or undefining such a container sets the contents back to the default value (or optionally removes it in cases where the default value can be autovivified on demand).
ja: そのようなコンテナを削除するか、undefiningすることは、デフォルト値（または、任意に、デフォルト値が要求に応じてautovivifiedされることができる場合、それを取り除く）まで、内容を戻す。

source: If you wish for a native declaration to attempt no initialization, but leave whatever garbage was in memory, you may use the is default(*) trait.
ja: たとえどんなゴミがメモリであったとしてもネイティブ宣言のために初期化を試みなくて、去りたいならば、あなたはis default(*)トレイトを使うかもしれない。

source: There are several use cases for this, if you know you're going to initialize the memory otherwise, or you're doing some form of memory mapping.
ja: あなたが特にメモリを初期化することになるということを知っているならば、いくつかの使用事例がこれのためにある、または、あなたは何らかのメモリマッピングをしている。

source: If a buf type is initialized with a Unicode string value, the string is decomposed into Unicode codepoints, and each codepoint shoved into an integer element.
ja: buf型がユニコード文字列値で初期化されるならば、文字列はユニコードコードポイントに分解される、そして、各々のコードポイントは整数要素に押した。

source: If the size of the buf type is not specified, it takes its length from the initializing string.
ja: buf型のサイズが指定されないならば、それは長さを初期化している文字列から引く。

source: If the size is specified, the initializing string is truncated or 0-padded as necessary.
ja: サイズが指定されるならば、初期化している文字列は頭を切って短くされるか、必要に応じて0パッドを入れられる。

source: If a codepoint doesn't fit into a buf's integer type, a parse error is issued if this can be detected at compile time;
ja: コードポイントが適合しないもしも、bufは整数型である、これがコンパイル時で見つけられることができるならば、解析エラーは出される;

source: otherwise a warning is issued at run time and the overflowed buffer element is filled with an appropriate replacement character, either U+FFFD (REPLACEMENT CHARACTER) if the element's integer type is at least 16 bits, or U+007f (DELETE) if the larger value would not fit.
ja: さもなければ、警告は実行時で発される、そして、氾濫する緩衝素子は適正置換文字（より大きな値が合わないならば要素の整数型が少なくとも16ビットまたはU+007f（削除する）であるならばどちらのU+FFFD（置換文字）でも）で満たされる。

source: If any other conversion is desired, it must be specified explicitly.
ja: 何か他の転換が要求されるならば、それははっきりと指定されなければならない。

source: In particular, no conversion to UTF-8 or UTF-16 is attempted;
ja: 特に、UTF-8またはUTF-16への転換は、試みられない;

source: that must be specified explicitly.
ja: それは、はっきりと指定されなければならない。

source: (As it happens, conversion to a buf type based on 32-bit integers produces valid UTF-32 in the native endianness.)
ja: （たまたま、32ビット整数に基づくbuf型への転換はネイティブendiannessで有効なUTF-32を生じる。）

source: The Mu type
ja: Mu型

source: Among other things, Mu is named after the eastern concept of &quot;Mu&quot; or 無 (see http://en.wikipedia.org/wiki/MU, especially the &quot;Mu (negative)&quot; entry), so in Perl 6 it stands in for Perl 5's concept of &quot;undef&quot; when that is used as a noun.
ja: その他のものと一緒に、Muは&quot;Mu&quot;または無の東の概念の名をとって名づけられる（特にhttp://en.wikipedia.org/wiki/MU,を見るムー（否定的な）エントリー）、Perl 6でそれがPerlに直面しそうなままであるように、5つはそれが名詞として使われる&quot;undef&quot;の概念である。

source: However, Mu is also the &quot;nothing&quot; from which everything else is derived via the undefined type objects, so it stands in for the concept of &quot;Object&quot; as used in languages like Java.
ja: しかし、Muであるまた、そうである何もでない、他の全てがどれを通して派生しているか、未定義型は反対するので、それはジャバのような言語にて用いられているように、オブジェクトの概念に直面しそうなままである。

source: Or think of it as a &quot;micro&quot; or μ-object that is the basis for all other objects, something atomic like a Muon.
ja: または、それを、他の全てのオブジェクト（μ中間子のように原子何か）の基礎である「マイクロ」またはμ-オブジェクトとみなしなさい。

source: Or if acronyms make you happy, there are a variety to pick from:
ja: または、頭字語があなたを幸せにするならば、以下から拾い上げる多様性がある：

source: Or just think of it as a sound a cow makes, which simultaneously means everything and nothing.
ja: または、ちょうど音としてそれの牛を製造（すべてと何も同時に意味しない）と考えなさい。

source: Undefined types
ja: 未定義型

source: Perl 6 does not have a single value representing undefinedness.
ja: Perl 6は、未定義を表現している一つの値も持たない。

source: Instead, objects of various types can carry type information while nevertheless remaining undefined themselves.
ja: その代わりに、それでも自分自身未定義ままの間、様々な型のオブジェクトは型情報をもたらすことができる。

source: Whether an object is defined is determined by whether .defined returns true or not.
ja: .definedが真実に返るかどうかにかかわらず、オブジェクトが定義されるかどうかは決定される。

source: These typed objects typically represent uninitialized values.
ja: これらの入力されたオブジェクトは、初期化されていない値を概して表現する。

source: Failure objects are also officially undefined despite carrying exception information;
ja: 失敗オブジェクトも、例外情報をもたらすことにもかかわらず、公式に未定義である;

source: these may be created using the fail function, or by direct construction of a Failure object of some sort.
ja: これらは、fail関数を用いて、または、何らかのFailureオブジェクトの直接の構築によってつくられるかもしれない。

source: (See S04 for how failures are handled.)
ja: （失敗が取り扱われる方法についてはS04を見なさい。）

source: Whenever you declare any kind of type, class, module, or package, you're automatically declaring a undefined prototype value with the same name, known as the type object.
ja: どんな型、クラス、モジュールまたはパッケージを宣言もするときはいつでも、あなたは同じ名前で未定義プロトタイプ値を自動的に宣言している。そして、型オブジェクトとして知られている。

source: The name itself returns that type object:
ja: 名前そのものは、その型オブジェクトを返る：

source: All user-defined classes derive from the Any class by default.
ja: すべてのユーザー定義のクラスは、デフォルトでAnyクラスに由来する。

source: Type objects sometimes stringify to their name in parens, to indicate undefinedness.
ja: オブジェクトが括弧で彼らの名前に時々stringifyする型（未定義を示すために）。

source: Note that type objects are not classes, but may be used to name classes when the type's associated meta-object allows it:
ja: 型オブジェクトがクラスでなくて、型の関連したメタオブジェクトがそれを許すとき名前クラスに使われるかもしれないことに注意すべきである：

source: The Any type encompasses all normal value and object types.
ja: Any型は、すべての通常の値とオブジェクトタイプを含む。

source: It is the unit type, but includes units that are containers of multiple values.
ja: それは単位型であるが、多値のコンテナである単位を含む。

source: It is not the most general type, however.
ja: しかし、それは最も一般的な型でない。

source: Any derives from Mu, which is the top type in Perl 6, and encompasses certain conceptual types that fall outside the realm of ordinary Any values.
ja: AnyはMu（それはPerl 6のトップ型である）に由来して、普通のAny値の領域から外れる特定の概念上の型を含む。

source: These conceptual types include:
ja: これらの概念上の型は以下を含む：

source: Conceptual types rely on the failure to match an Any type in order to trigger various extraordinary behaviors.
ja: 概念上の型は、いろいろな並外れた性質を起動させるためにAny型にマッチする失敗に頼る。

source: The Junction and Each types trigger an inside-out linguistic distribution of various list behaviors from inside a scalar expression that pretends a bunch of values are really a single value.
ja: JunctionとEach型は、たくさんの値が本当に一つの値であると偽るスカラー式の中にから、いろいろなリスト性質のインサイドアウト言語配布を誘発する。

source: (These are modeled on similar linguistic behaviors in English.) The distributional behavior triggered for these types is known as autothreading.
ja: autothreadingするように、これらの型のために引き起こされる分配ふるまいは知られている（これらは英語で類似した言語性質にならって作られる。）。

source: The Failure type is considered conceptual so that dynamic context can determine the treatment of failures that in other languages would always throw exceptions.
ja: ダイナミックな前後関係が他の言語の常に例外を投げる失敗の治療を決定することができるように、Failure型は概念的であると考えられる。

source: This gives Perl 6 programs the flexibility to handle exceptions either in-band or out-of-band.
ja: これは、帯域内であるか帯域外例外を取り扱うために、Perl 6プログラムに柔軟性を与える。

source: It is particularly important to be able to handle exceptions in-band when you are trying to perform parallel operations, so that the failure of one computation does not result in fratricide of all its fellow computations.
ja: あなたが並行オペレーションを行おうとしているとき、帯域内例外を取り扱うことができることは特に重要である、そのため、1つの計算の失敗が結果としてすべてのその仲間の計算の兄弟殺しになるというわけではない。

source: (You can think of this as analogous to the way NaN propagates through floating-point calculations.)
ja: （NaNが浮動小数点計算を通して伝播する方法に類似しているように、あなたはこれについて考えることができる。）

source: Single dispatch of a Failure invocant to any method not in Failure returns the same Failure, so that cascaded method calls can be checked with a single check:
ja: Failureの何かメソッドへのFailureインボカントの一つのディスパッチも同じFailureを返らない、そのため、カスケードされたメソッド呼び出しは一回のチェックと照合されることができる：

source: Failures may only be passed into functions via parameters that allow Mu or Failure, and a failure may only be returned from a function whose return type permits it.
ja: 失敗はMuまたはFailureを許すパラメータを通して関数に通過されるだけかもしれない、そして、失敗は戻り型がそれを許す関数から返納印である場合があるだけである。

source: After the failure is returned, any subsequent attempt to use the failure in an Any context will be subject to further failure analysis, and will likely throw an exception immediately.
ja: 失敗が不履行を使う返られた、少しも以降の試みであったあと、Any前後関係は更なる不良解析を受けて、すぐに例外をたぶん投げる。

source: Likewise, discarding the failure in sink context produces an immediate exception.
ja: 同様に、不履行シンク前後関係を放棄することは、即時の例外を生じる。

source: Note that a Failure object is undefined, but may contain one or more defined Exception objects, which are considered normal objects that just happen to be used in exception throwing and handling.
ja: Failureオブジェクトが未定義であるが、一つ以上の定義済みExceptionオブジェクトを含むかもしれないことに注意すべきである。そして、それはちょうど偶然例外投げと取扱いにおいて使われることが起こる考えられた通常のオブジェクトである。

source: Immutable types
ja: 不変の型

source: Objects with these types behave like values, i.e. $x === $y is true if and only if their types and contents are identical (that is, if $x.WHICH eqv $y.WHICH).
ja: これらの型によるオブジェクトは値のようにふるまう、すなわち、彼らの型と内容が同一の（つまり、$x.WHICH eqv $y.WHICHならば）場合に限り、$x === $yは真実である。

source: Set values may be composed with the set listop or method. Bag values may be composed with the bag listop or method. Mix values may be composed with the mix listop or method.
ja: Set値はset listopまたはメソッドで組み立てられるかもしれない。Bag値はbag listopまたはメソッドで組み立てられるかもしれない。Mix値は｛混合物｝listopまたはメソッドで組み立てられるかもしれない。

source: Instants and Durations are measured in atomic seconds with fractions.
ja: InstantsとDurationsは、分数で原子秒で測られる。

source: Notionally they are real numbers which may be implemented in any Real type of sufficient precision, preferably a Rat or FatRat.
ja: 抽象的に、それらは、十分な精度、望ましくはRatまたはFatRatの何かReal型で実装されるかもしれない実数である。

source: (Implementations that make fixed-point assumptions about the available subsecond precision are discouraged;
ja: （利用できるsubsecond精度について固定小数点奪取をする実装は、はばまれる;

source: the user interface must act like real numbers in any case.) Interfaces that take Duration arguments, such as sleep(), may also take Real arguments, but Instant arguments must be explicitly created via any of various culturally aware time specification APIs. A small number of Instant values that represent common epoch instant values are also available.
ja: ユーザインタフェースは、いずれにせよ実数のようなふりをしなければならない。）、Durationに引数（例えばsleep()）を持っていくインターフェースは、Realにも引数を持っていくかもしれない、しかし、Instant引数は、いろいろな文化的にわかっている時間仕様APIのどれによってでも、はっきりとつくられなければならない。一般のエポック瞬間値を表現する少数のInstant値も、利用できる。

source: In numeric context a Duration happily returns a Rat or FatRat representing the number of seconds.
ja: 数値コンテキストでは、Durationは、秒数を表現しているRatまたはFatRatを首尾よく返る。

source: Instant values, on the other hand, are largely opaque, numerically speaking, and in particular are epoch agnostic.
ja: Instant値は、他方、主に不透明で、数値的に話していて、特にエポックを選ばないものである。

source: (Any epoch is just a particular Instant, and all times related to that epoch are really Instant ± Duration, which returns a new Instant.) In order to facilitate the writing of culturally aware time modules, the Instant type provides Instant values corresponding to various commonly used epochs, such as the 1958 TAI epoch, the POSIX epoch, the Mac epoch, and perhaps the year 2000 epoch as UTC thinks of it.
ja: 文化的にわかっているタイムモデュールを書くことを促進するために、｛即座の｝型はいろいろな一般的に用いられるエポック（例えば1958のタイ系諸族のエポック、POSIXエポック、Macエポック）と一致している値を提供する｛即座の｝（何かエポックはちょうど特定のInstantである、そして、そのエポックに関連したすべての時代は本当にInstant±Durationである。そして、それは新しいInstantを返る。）、そして、UTCとしてのだいたい2000年エポックはそれについて考える。

source: There's no reason to exclude any useful epoch that is well characterized in atomic seconds.
ja: 原子秒でよく特徴づけられる少しも役に立つエポックを除外する理由が、ない。

source: All normal times can be calculated from those epoch instants using addition and subtraction of Duration values. Note that the Duration values are still just atomic time without any cultural deformations;
ja: 標準時間の間ずっとはDuration値の加算と減算を使用しているそれらのエポック瞬間から計算されることができる。Duration値がまだちょうど何か文化的な変形のない原子時間であることに注意すべきである;

source: in particular, the Duration formed of by subtracting Instant::Epoch::POSIX from the current instant will contain more seconds than the current POSIX time() due to POSIX's abysmal ignorance of leap seconds.
ja: 特に、Instant::Epoch::POSIXを現在の瞬間から引くことによってできられるDurationは、閏秒についてのPOSIXの実にひどい不案内のための現在のPOSIX time()より多くの秒を含む。

source: This is not the fault of the universe, which is not fooled (neglecting relativistic considerations).
ja: これは宇宙の誤りでない。そして、それは馬鹿にされない（相対論的な考慮点を怠る）。

source: Instants and Durations are always linear atomic seconds.
ja: InstantsとDurationsは、常に線形原子秒である。

source: Systems which cannot officially provide a steady time base, such as POSIX systems, will simply have to make their best guess as to the correct atomic time when asked to interconvert between cultural time and atomic time.
ja: 文化的な時間と原子時間の間でinterconvertに尋ねられるとき、安定したタイムベース（例えばPOSIXシステム）を公式に提供することができないシステムは単に彼らのベストを正しい原子時間に関して推測させなければならない。

source: Alternately, they may use some other less-official time mechanism to achieve steady clock behavior.
ja: あるいは、それらは、落ち着いた時計ふるまいを成し遂げるために、若干の他のより公式でない時間メカニズムを使うかもしれない。

source: Most Unix systems can count clock ticks, even if POSIX time types get confused.
ja: たとえPOSIX回の型が混乱するとしても、大部分のUnixシステムはクロック単位を数えることができる。

source: Although the conceptual type of an Instant resembles FatRat, with arbitrarily large size in either numerator or denominator, the internal form may of course be optimized internally for &quot;nearby&quot; times, so that, if we know the year as an integer, the instant within the year can just be a Rat representing the offset from the beginning of the year.
ja: Instantの概念上の型がFatRatに似ているが、どちらの分子または分母の任意にかなりのサイズででも、内部の形はもちろん近くの時代のために内部的に最適化されるかもしれない、そのため、我々が年を整数として知っているならば、年以内の瞬間はちょうど期首からオフセットを表現しているRatでありえる。

source: Calculations that fall within the same year can then be done in Rat rather than FatRat, or a table of yearly offsets can find the difference in integer seconds between two years, since (so far) nobody has had the nerve to propose fractional leap seconds.
ja: それから、同じ年に入る計算はFatRatよりもむしろRatでされることができる、または、誰もわずかな閏秒を提案するために図々しくなかった時から（ここまで）、年間オフセットの表は2年の間で違いを整数おかわりで見つけることができる。

source: Or whatever.
ja: または、いったい何。

source: Instant is opaque, so we can swap implementations in and out without user-visible consequences.
ja: Instantは不透明であるので、我々はユーザー見える結果なしで中に、そして、外に実装を交換することができる。

source: The term now returns the current time as an Instant.
ja: 項nowは、Instantとして現在の時返る。

source: As with the rand and self terms, it is not a function, so don't put parens after it.
ja: randとself項と同様に、それは関数でないので、それの後括弧を置いてはいけない。

source: It also never looks for arguments, so the next token should be an operator or terminator.
ja: それも引数を決して探さないので、次のトークンは演算子またはターミネータでなければならない。

source: Basic math operations are defined for instants and durations such that the sum of an instant and a duration is always an instant, while the difference of two instants is always a duration.
ja: 2つの瞬間の違いが常に期間である間、瞬間と期間の合計が常に瞬間であるように、基本的な演算操作は瞬間と期間の間定義される。

source: Math on instants may only be done with durations (or numbers that will be taken as durations, as above);
ja: 瞬間の数学は、期間（または、上記のように、期間としてとられる数）で、されるだけかもしれない;

source: you may not add two instants.
ja: 2つの瞬間を加えなくてもよい。

source: Numeric operations on durations return Duration where that makes sense (addition, subtraction, modulus).
ja: 期間の算術演算は、それが意味をなす（追加、引き算、率）Durationを返る。

source: The type returned for other numeric operations is unspecified;
ja: 他の算術演算のために返納印型は、明らかでない;

source: they may return normal numeric types or they may return other dimensional types that attempt to assist in dimensional analysis.
ja: それらは通常の数値型を返るかもしれない、または、それらは次元解析を援助しようとする他の次元の型を返るかもしれない。

source: (The latter approach should likely require explicit declaration for now, until we can demonstrate that it does not adversely impact the average programmer, and that it plays well with the concept of gradual typing.)
ja: （我々がそれが平均的プログラマに逆に衝撃を与えない、そして、それが段階的なタイピングの概念でうまくやることを証明することができるまで、後のアプローチは今のところ明示的宣言をたぶん必要としなければならない。）

source: The Blob type is like an immutable buffer, and therefore responds both to array and (some) stringy operations.
ja: Blob型は不変のバッファのようで、したがって、配列と（いくつか）繊維質の演算に応じる。

source: Note that, like a Buf, its size is measured in whatever the base unit is, which is not always bytes.
ja: なお、Bufのように、そのサイズは基本単位がそうであるものは何ででも計られる。そして、それは必ずしもバイトでない。

source: If you have a my Blob[bit] $blob, then $blob.elems returns the number of bits in it.
ja: あなたがmy Blob[bit] $blobを持つならば、$blob.elemsはそれの中にビットの数を返る。

source: As with buffers, various native types are automatically derived from native unsigned int types:
ja: バッファと同様に、いろいろなネイティブ型は、ネイティブ符号なしint型に自動的に由来する：

source: The utf8 type is derived from blob8, with the additional constraint that it may only contain validly encoded UTF-8.
ja: それが有効にコード化されたUTF-8を含むだけかもしれない更なる制約で、utf8型は、blob8に由来する。

source: Likewise, utf16 is derived from blob16, and utf32 from blob32.
ja: 同様に、utf16はblob16とblob32からutf32に由来する。

source: Note that since these are type names, parentheses must always be used to call them as coercers, since the listop form is not allowed for coercions.
ja: listopの形がコアーションのために許されない時から、これらがタイプ名である時から、括弧が常に強制者としてそれらを呼ぶのに用いられなければならない点に注意しなさい。

source: is always parsed as
ja: 常に解析される

source: and never as
ja: そして、決してでなく、

source: These types do (at least) the following roles:
ja: これらの型は、以下のロールをする（少なくとも）：

source: [Conjecture: Stringy may best be split into 2 roles where both Str and Blob compose the more general one and just Str composes a less general one.
ja: ［推測しなさい：StringyはStrとBlobがより一般的なものを組み立てる2つのロールに最も分けられるかもしれない、そして、ちょうどStrはより少ない一般1を組み立てる。
